# Data Cleaning/Prep Script

## Section 0: Initial Setup

### Section 0.x: Import required libraries

In [1]:
import pandas as pd
import datetime
import numpy as np

### Section 0.x: Read in the data

In [2]:
df = pd.read_csv('ppr-17309836.csv', keep_default_na=True, sep=',', skipinitialspace=True, engine="python")

In [3]:
df.head()

,Date of Sale (dd/mm/yyyy),Address,Postal Code,County,Price (€),Not Full Market Price,VAT Exclusive,Description of Property,Property Size Description
0,21/05/2020,"BALLYGLASS, STROKESTOWN RD, LANESBORO",NaN,Roscommon,"€180,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN
1,08/09/2011,"26 Newpark, Kilkenny",NaN,Kilkenny,"€73,500.00",No,No,Second-Hand Dwelling house /Apartment,NaN
2,24/09/2021,"23 THE COURTYARD, CLONSILLA, DUBLIN 15",Dublin 15,Dublin,"€280,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN
3,18/08/2021,"137 RACECOURSE MEADOWS, RACECOURSE RD, DUNDALK",NaN,Louth,"€205,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN
4,02/08/2013,"96 Shantalla Road, Beaumont",Dublin 9,Dublin,"€282,500.00",No,No,Second-Hand Dwelling house /Apartment,NaN

### Section 0.x: Change the column names

In [4]:
df.columns = df.columns.str.replace(' ', '_')

### Section 0.x: Change the data types

In [5]:
# Remove € and , characters and convert to float
df["Price_(€)"] = df["Price_(€)"].replace("[\€,]", "", regex=True).astype(float)

In [6]:
df["Date_of_Sale_(dd/mm/yyyy)"] = pd.to_datetime(df["Date_of_Sale_(dd/mm/yyyy)"], format="%d/%m/%Y")
df.rename(columns={"Date_of_Sale_(dd/mm/yyyy)": "Date_of_Sale"}, inplace=True)

In [7]:
# Select all columns of type 'object'
object_columns = df.select_dtypes(['object']).columns

# Convert selected columns to type 'category'
for column in object_columns:
    df[column] = df[column].astype('category')
df.dtypes

Date_of_Sale                 datetime64[ns]
Address                            category
Postal_Code                        category
County                             category
Price_(€)                           float64
Not_Full_Market_Price              category
VAT_Exclusive                      category
Description_of_Property            category
Property_Size_Description          category
dtype: object

In [8]:
df.head()

,Date_of_Sale,Address,Postal_Code,County,Price_(€),Not_Full_Market_Price,VAT_Exclusive,Description_of_Property,Property_Size_Description
0,2020-05-21,"BALLYGLASS, STROKESTOWN RD, LANESBORO",NaN,Roscommon,180000.0,No,No,Second-Hand Dwelling house /Apartment,NaN
1,2011-09-08,"26 Newpark, Kilkenny",NaN,Kilkenny,73500.0,No,No,Second-Hand Dwelling house /Apartment,NaN
2,2021-09-24,"23 THE COURTYARD, CLONSILLA, DUBLIN 15",Dublin 15,Dublin,280000.0,No,No,Second-Hand Dwelling house /Apartment,NaN
3,2021-08-18,"137 RACECOURSE MEADOWS, RACECOURSE RD, DUNDALK",NaN,Louth,205000.0,No,No,Second-Hand Dwelling house /Apartment,NaN
4,2013-08-02,"96 Shantalla Road, Beaumont",Dublin 9,Dublin,282500.0,No,No,Second-Hand Dwelling house /Apartment,NaN

## Section 1: Address

### Section 1.x: Convert all addresses to small caps

In [9]:
def convert_to_small_caps(address):
    """Function for converting an address to lower case"""
    return address.lower()

In [10]:
df["Address"] = df["Address"].apply(convert_to_small_caps)

In [11]:
df.head()

,Date_of_Sale,Address,Postal_Code,County,Price_(€),Not_Full_Market_Price,VAT_Exclusive,Description_of_Property,Property_Size_Description
0,2020-05-21,"ballyglass, strokestown rd, lanesboro",NaN,Roscommon,180000.0,No,No,Second-Hand Dwelling house /Apartment,NaN
1,2011-09-08,"26 newpark, kilkenny",NaN,Kilkenny,73500.0,No,No,Second-Hand Dwelling house /Apartment,NaN
2,2021-09-24,"23 the courtyard, clonsilla, dublin 15",Dublin 15,Dublin,280000.0,No,No,Second-Hand Dwelling house /Apartment,NaN
3,2021-08-18,"137 racecourse meadows, racecourse rd, dundalk",NaN,Louth,205000.0,No,No,Second-Hand Dwelling house /Apartment,NaN
4,2013-08-02,"96 shantalla road, beaumont",Dublin 9,Dublin,282500.0,No,No,Second-Hand Dwelling house /Apartment,NaN

### Section 1.x: Convert Postal Code values to lowercase (for comparability)

In [12]:
df["Postal_Code"] = df["Postal_Code"].apply(convert_to_small_caps)

In [13]:
df.head()

,Date_of_Sale,Address,Postal_Code,County,Price_(€),Not_Full_Market_Price,VAT_Exclusive,Description_of_Property,Property_Size_Description
0,2020-05-21,"ballyglass, strokestown rd, lanesboro",NaN,Roscommon,180000.0,No,No,Second-Hand Dwelling house /Apartment,NaN
1,2011-09-08,"26 newpark, kilkenny",NaN,Kilkenny,73500.0,No,No,Second-Hand Dwelling house /Apartment,NaN
2,2021-09-24,"23 the courtyard, clonsilla, dublin 15",dublin 15,Dublin,280000.0,No,No,Second-Hand Dwelling house /Apartment,NaN
3,2021-08-18,"137 racecourse meadows, racecourse rd, dundalk",NaN,Louth,205000.0,No,No,Second-Hand Dwelling house /Apartment,NaN
4,2013-08-02,"96 shantalla road, beaumont",dublin 9,Dublin,282500.0,No,No,Second-Hand Dwelling house /Apartment,NaN

### Section 1.x: Create a list of valid postal codes

In [14]:
# Create a list for storing postal codes and initialise this list with the county Dublin 6w
postal_codes = ["dublin 6w"]

# Loop through all valid postal code numbers to create a list of valid postal codes
for i in range(1, 25):
    if i in [19, 21, 23]:
        continue
    postal_codes.append("dublin " + str(i))

postal_codes

['dublin 6w',
 'dublin 1',
 'dublin 2',
 'dublin 3',
 'dublin 4',
 'dublin 5',
 'dublin 6',
 'dublin 7',
 'dublin 8',
 'dublin 9',
 'dublin 10',
 'dublin 11',
 'dublin 12',
 'dublin 13',
 'dublin 14',
 'dublin 15',
 'dublin 16',
 'dublin 17',
 'dublin 18',
 'dublin 20',
 'dublin 22',
 'dublin 24']

### Section 1.x: Add all postal codes from address to postal code when postal code is NAN

In [15]:
# Count of NAN values before using address postal codes
df["Postal_Code"].isna().sum()

8068

In [16]:
def address_postal_adder(address, postal_code):
    """Function that adds the address postal code to the postal code column when it is a valid postal code and the postal code value is missing"""
    new_postal_code = ""

    for valid_postal_code in postal_codes:
        if (valid_postal_code in address) and (pd.isnull(postal_code)) and (len(valid_postal_code) > len(new_postal_code)):
            print(valid_postal_code, address, postal_code)
            new_postal_code = valid_postal_code
    
    if len(new_postal_code) > 0:
        return new_postal_code

    return postal_code

In [17]:
df["Postal_Code"] = df.apply(lambda x: address_postal_adder(x["Address"], x["Postal_Code"]), axis=1)

dublin 9 306 carrington block h, northwood, dublin 9 nan
dublin 1 406 edges 3 beacon court, sandyford, dublin 18 nan
dublin 18 406 edges 3 beacon court, sandyford, dublin 18 nan
dublin 6w 23 glendown park, templeogue, dublin 6w nan
dublin 1 3 belvedere road, dublin 1 nan
dublin 6 23 the laurels, terenure rd west, dublin 6 nan
dublin 2 24a glenpark close, palmerstown, dublin 20 nan
dublin 20 24a glenpark close, palmerstown, dublin 20 nan
dublin 1 35 upper mayor street, dublin 1 nan
dublin 1 1 templeville dr, templeogue, dublin 16 nan
dublin 16 1 templeville dr, templeogue, dublin 16 nan
dublin 1 18 diswellstown view, castleknock, dublin 15 nan
dublin 15 18 diswellstown view, castleknock, dublin 15 nan
dublin 4 44 the claytons, the gasworks, dublin 4 nan
dublin 4 14 ennis grove, sandymount, dublin 4 nan
dublin 8 172 ceannts fort, mountbrown, dublin 8 nan
dublin 1 19 hollywoodrath park, hollystown, dublin 15 nan
dublin 15 19 hollywoodrath park, hollystown, dublin 15 nan
dublin 1 no. 38 wilkins view, greenhills, dublin 12 nan
dublin 12 no. 38 wilkins view, greenhills, dublin 12 nan
dublin 6w 44 terenure rd, north, dublin 6w nan
dublin 1 38 old finglas rd, glasnevin, dublin 11 nan
dublin 11 38 old finglas rd, glasnevin, dublin 11 nan
dublin 1 140 clonard rd, crumlin, dublin 12 nan
dublin 12 140 clonard rd, crumlin, dublin 12 nan
dublin 4 48 merrion road, ballsbridge, dublin 4 nan
dublin 1 46 leopardstown grove, leopardstown, dublin 18 nan
dublin 18 46 leopardstown grove, leopardstown, dublin 18 nan
dublin 1 13 castlefield dr, castlefield manor, knocklyon dublin 16 nan
dublin 16 13 castlefield dr, castlefield manor, knocklyon dublin 16 nan
dublin 2 11 edenbrook close, edenbrook citywest, dublin 24 nan
dublin 24 11 edenbrook close, edenbrook citywest, dublin 24 nan
dublin 1 31 ballyroan rd, templeogue, dublin 16 nan
dublin 16 31 ballyroan rd, templeogue, dublin 16 nan
dublin 4 101 shrewsbury, ballsbridge, dublin 4 nan
dublin 4 55 haddington rd, donnybrook, dublin 4 nan
dublin 1 28 walkinstown green, dublin 12 nan
dublin 12 28 walkinstown green, dublin 12 nan
dublin 1 86 kirpatrick house, spencer dock, dublin 1 nan
dublin 2 32 lower camden street, dublin 2 nan
dublin 1 50a beechwood downs, huntstown, dublin 15 nan
dublin 15 50a beechwood downs, huntstown, dublin 15 nan
dublin 1 165 crumlin rd, dublin 12 nan
dublin 12 165 crumlin rd, dublin 12 nan
dublin 6w 36 cedar court, terenure, dublin 6w nan
dublin 6 49 leeson park, dublin 6 nan
dublin 1 3 meadow close, churchtown, dublin 14 nan
dublin 14 3 meadow close, churchtown, dublin 14 nan
dublin 1 apt 33 stapleton house, 33 mountjoy square, dublin 1 nan
dublin 4 42 upper leeson st, donnybrook, dublin 4 nan
dublin 1 22 ashfield grove, huntstown, dublin 15 nan
dublin 15 22 ashfield grove, huntstown, dublin 15 nan
dublin 7 32 broombridge road, cabra, dublin 7 nan
dublin 6 9 belgrave square, rathmines, dublin 6 nan
dublin 2 10 redwood lawns, kilnamanagh, dublin 24 nan
dublin 24 10 redwood lawns, kilnamanagh, dublin 24 nan
dublin 8 32 haroldville avenue, south circular road, dublin 8 nan
dublin 1 92 parnell street, dublin 1 nan
dublin 6w 10 hazelbrook court, terenure rd west, dublin 6w nan
dublin 1 464 castleforbes square, upper mayor street, dublin 1 nan
dublin 8 144 rialto cottages, rialto, dublin 8 nan
dublin 8 35 mellowes quay, dublin 8 nan
dublin 6 36 temple hall, mount st annes, milltown dublin 6 nan
dublin 1 59 landscape park, churchtown, dublin 14 nan
dublin 14 59 landscape park, churchtown, dublin 14 nan
dublin 6w 43 lavarna grove, terenure, dublin 6w nan
dublin 8 183 emmet rd, dublin 8 nan
dublin 6w 3 wellington road, templeogue, dublin 6w nan
dublin 3 8 chelsea gardens, clontarf, dublin 3 nan
dublin 6 9 manor villas, mount argus grove, mount argus rd dublin 6 nan
dublin 9 1 shanboley road, santry, dublin 9 nan
dublin 2 20 old bawn drive, tallaght, dublin 24 nan
dublin 24 20 old bawn drive, tallaght, dublin 24 nan
dublin 5 32 kilmore avenue, coolock, dublin 5 nan
dublin 1 155 woodfield, scholarstown, dublin 16 nan
dublin 16 155 woodfield, scholarstown, dublin 16 nan
dublin 1 6 healy street, dublin 1 nan
dublin 1 32 glin road, coolock, dublin 17 nan
dublin 17 32 glin road, coolock, dublin 17 nan
dublin 9 38 upper drumcondra road, dublin 9 nan
dublin 7 110 cabra road, cabra, dublin 7 nan
dublin 1 3 dorset lane, dublin 1 nan
dublin 1 24 rutland cottages, summerhill, dublin 1 nan
dublin 1 53 the courtyard, clonsilla, dublin 15 nan
dublin 15 53 the courtyard, clonsilla, dublin 15 nan
dublin 1 47 marian cresent, rathfarnham, dublin 14 nan
dublin 14 47 marian cresent, rathfarnham, dublin 14 nan
dublin 5 28a mount olive grove, kilbarrack, dublin 5 nan
dublin 3 109 brian road, marino, dublin 3 nan
dublin 8 26 kickham road, inchicore, dublin 8 nan
dublin 1 the gate lodge, rathfarnham castle, dublin 14 nan
dublin 14 the gate lodge, rathfarnham castle, dublin 14 nan
dublin 1 15 walkinstown parade, dublin 12 nan
dublin 12 15 walkinstown parade, dublin 12 nan
dublin 1 apartment 1, 96 capel street, dublin 1 nan
dublin 8 5 the tramyard exchange, 27 carmens hall, dublin 8 nan
dublin 7 apartment no 7 smithfield lofts, north king street, dublin 7 nan
dublin 1 4 cherbury mews, knocklyon, dublin 16 nan
dublin 16 4 cherbury mews, knocklyon, dublin 16 nan
dublin 1 134 curlew road, drimnagh, dublin 12 nan
dublin 12 134 curlew road, drimnagh, dublin 12 nan
dublin 8 apt 1, 63/64 thomas street, dublin 8 nan
dublin 5 21 kilmore avenue, artane, dublin 5 nan
dublin 1 2 dunbo terrace, howth, dublin 13 nan
dublin 13 2 dunbo terrace, howth, dublin 13 nan
dublin 1 144 moyville, rathfarnham, dublin 16 nan
dublin 16 144 moyville, rathfarnham, dublin 16 nan
dublin 8 15 connolly avenue, inchicore, dublin 8 nan
dublin 1 18 stapolin house, myrtle court, the coast dublin 13 nan
dublin 13 18 stapolin house, myrtle court, the coast dublin 13 nan
dublin 8 20 canon court, bride street, dublin 8 nan
dublin 1 43 clonlea, ballinteer, dublin 16 nan
dublin 16 43 clonlea, ballinteer, dublin 16 nan
dublin 7 10 the hardwiche, brunswick street north, dublin 7 nan
dublin 2 352 bachelors walk, dublin 2 nan
dublin 1 42 st peters drive, greenhills, dublin 12 nan
dublin 12 42 st peters drive, greenhills, dublin 12 nan
dublin 7 29 charleville road, phibsboro, dublin 7 nan
dublin 6 59 lower beechwood avenue, ranelagh, dublin 6 nan
dublin 1 13 hampton wood lawn, hampton wood, dublin 11 nan
dublin 11 13 hampton wood lawn, hampton wood, dublin 11 nan
dublin 9 23 shanowen avenue, santry, dublin 9 nan
dublin 8 181 emmet road, inchicore, dublin 8 nan
dublin 7 the nunciature, navan road, dublin 7 nan
dublin 9 98  iveragh road, whitehall, dublin 9 nan
dublin 7 28 hampton green, navan road, dublin 7 nan
dublin 7 apartment no 163, smithfield village, dublin 7 nan
dublin 6w 105 larkfield grove, harolds cross, dublin 6w nan
dublin 6w 2 wainsfort ave, terenure, dublin 6w nan
dublin 5 watermill road, raheny, dublin 5 nan
dublin 1 68 whitechurch way, rathfarnham, dublin 16 nan
dublin 16 68 whitechurch way, rathfarnham, dublin 16 nan
dublin 1 38 ballyfermot drive, ballyfermot, dublin 10 nan
dublin 10 38 ballyfermot drive, ballyfermot, dublin 10 nan
dublin 6w 512 orwell park way, templeogue, dublin 6w nan
dublin 1 1 grangebrook avenue, rathfarnham, dublin 16 nan
dublin 16 1 grangebrook avenue, rathfarnham, dublin 16 nan
dublin 6w 170 corrib road, terenure, dublin 6w nan
dublin 4 11 gilford tce, dublin 4 nan
dublin 1 24 maple manor, cabinteely, dublin 18 nan
dublin 18 24 maple manor, cabinteely, dublin 18 nan
dublin 1 26  hampton wood drive, hampton wood, dublin 11 nan
dublin 11 26  hampton wood drive, hampton wood, dublin 11 nan
dublin 6w cranford house, 325 templeogue rd, dublin 6w nan
dublin 4 20 tritonville avenue, sandymount, dublin 4 nan
dublin 7 439 north circular road, dublin 7 nan
dublin 1 10 old rectory park, dundrum, dublin 14 nan
dublin 14 10 old rectory park, dundrum, dublin 14 nan
dublin 1 apartment 169, grande central, rockbrook sandyford  dublin 18 nan
dublin 18 apartment 169, grande central, rockbrook sandyford  dublin 18 nan
dublin 7 40 north circular road, phibsboro, dublin 7 nan
dublin 1 7a dunsink avenue, finglas, dublin 11 nan
dublin 11 7a dunsink avenue, finglas, dublin 11 nan
dublin 1 814 vantage east, leopardstown, dublin 18 nan
dublin 18 814 vantage east, leopardstown, dublin 18 nan
dublin 8 2 windsor terrace, portbello, dublin 8 nan
dublin 6w 42 willington dr, templeogue, dublin 6w nan
dublin 6w 303 orwell park grove, templeogue, dublin 6w nan
dublin 1 21 mount eagle drive, leopardstown heights, dublin 18 nan
dublin 18 21 mount eagle drive, leopardstown heights, dublin 18 nan
dublin 6 18 riverside walk, clonskeagh, dublin 6 nan
dublin 1 6 poppintree terrace, poppintree, dublin 11 nan
dublin 11 6 poppintree terrace, poppintree, dublin 11 nan
dublin 1 84 hollywoodrath avenue, hollystown, dublin 15 nan
dublin 15 84 hollywoodrath avenue, hollystown, dublin 15 nan
dublin 1 30 gurteen park, ballyfermot, dublin 10 nan
dublin 10 30 gurteen park, ballyfermot, dublin 10 nan
dublin 6w 24 willington lawn, templeogue, dublin 6w nan
dublin 1 7 hersil wood, knocklyon, dublin 16 nan
dublin 16 7 hersil wood, knocklyon, dublin 16 nan
dublin 2 1 tymonville lawns, tallaght, dublin 24 nan
dublin 24 1 tymonville lawns, tallaght, dublin 24 nan
dublin 6w 96 corrib rd, terenure, dublin 6w nan
dublin 6w 40 rossmore lawns, templeogue, dublin 6w nan
dublin 6w 23 terenure gate, terenure, dublin 6w nan
dublin 1 97 delwood walk, castleknock, dublin 15 nan
dublin 15 97 delwood walk, castleknock, dublin 15 nan
dublin 1 14 eden court, rathfarnham, dublin 16 nan
dublin 16 14 eden court, rathfarnham, dublin 16 nan
dublin 2 48 monastery gate avenue, clondalkin, dublin 22 nan
dublin 22 48 monastery gate avenue, clondalkin, dublin 22 nan
dublin 1 150 howth road, sutton, dublin 15 nan
dublin 15 150 howth road, sutton, dublin 15 nan
dublin 1 32 hazelbrook apts, upper kilmacud rd, dublin 14 nan
dublin 14 32 hazelbrook apts, upper kilmacud rd, dublin 14 nan
dublin 1 apartment 43, buckingham village, dublin 1 nan
dublin 1 3 the grove, churchtown, dublin 14 nan
dublin 14 3 the grove, churchtown, dublin 14 nan
dublin 9 29 elm mount rise, beamount, dublin 9 nan
dublin 1 22 stanaway road, kimmage, dublin 12 nan
dublin 12 22 stanaway road, kimmage, dublin 12 nan
dublin 1 102 ballinteer park, dundrum, dublin 16 nan
dublin 16 102 ballinteer park, dundrum, dublin 16 nan
dublin 6w 50 larkfield gardens, harolds cross, dublin 6w nan
dublin 7 1 drumcliffe drive, cabra west, dublin 7 nan
dublin 1 42 huband road, bluebell, dublin 12 nan
dublin 12 42 huband road, bluebell, dublin 12 nan
dublin 1 130 bangor road, crumlin, dublin 12 nan
dublin 12 130 bangor road, crumlin, dublin 12 nan
dublin 1 147 park drive avenue, castleknock, dublin 15 nan
dublin 15 147 park drive avenue, castleknock, dublin 15 nan
dublin 6 'lisheen', no 45 bushy park road, dublin 6 nan
dublin 3 140 vernon avenue, clontarf, dublin 3 nan
dublin 1 11 stralem court, ongar wood, dublin 15 nan
dublin 15 11 stralem court, ongar wood, dublin 15 nan
dublin 1 34c lansdowne valley apartments, drimnagh, dublin 12 nan
dublin 12 34c lansdowne valley apartments, drimnagh, dublin 12 nan
dublin 6w 204 templeogue road, dublin 6w nan
dublin 6w 21 osprey park, templeogue, dublin 6w nan
dublin 1 20 knockfield manor, knocklyon, dublin 16 nan
dublin 16 20 knockfield manor, knocklyon, dublin 16 nan
dublin 1 62 kirkpatrick house, north wall quay, dublin 1 nan
dublin 1 21  mount garrett walk, tyrrellstown, dublin 15 nan
dublin 15 21  mount garrett walk, tyrrellstown, dublin 15 nan
dublin 6w 19 templeogue lodge, templeogue, dublin 6w nan
dublin 6w 186 harolds cross rd, harolds cross, dublin 6w nan
dublin 4 25 rowan house, mespil road, dublin 4 nan
dublin 1 49 sandyford hall view, sandyford, dublin 18 nan
dublin 18 49 sandyford hall view, sandyford, dublin 18 nan
dublin 6w 5 templeville dr, terenure, dublin 6w nan
dublin 1 7 clifden drive, ballyfermot, dublin 10 nan
dublin 10 7 clifden drive, ballyfermot, dublin 10 nan
dublin 6w 21 st clares ave, harolds cross, dublin 6w nan
dublin 5 27 brookwood rd, dublin 5, dublin nan
dublin 1 12 riverwood square, carpenterstown, dublin 15 nan
dublin 15 12 riverwood square, carpenterstown, dublin 15 nan
dublin 6w apt 198a, harolds cross rd, dublin 6w nan
dublin 8 122 rialto cottages, rialto, dublin 8 nan
dublin 8 29 hammond street, blackpits, dublin 8 nan
dublin 6w 16 terenure park, terenure, dublin 6w nan
dublin 1 24 ballinteer gardens, ballinteer, dublin 16 nan
dublin 16 24 ballinteer gardens, ballinteer, dublin 16 nan
dublin 9 87 annadale drive, drumcondra, dublin 9 nan
dublin 1 49 grange manor drive, rathfarnham, dublin 14 nan
dublin 14 49 grange manor drive, rathfarnham, dublin 14 nan
dublin 6w 19 derravaragh rd, terenure, dublin 6w nan
dublin 2 apt 6, 43 east essex street, dublin 2 nan
dublin 6 31 the cloisters, mount talant ave, dublin 6 nan
dublin 4 1 south dock street, ringsend, dublin 4 nan
dublin 1 6 the lawn, woodpark, ballinteer dublin 16 nan
dublin 16 6 the lawn, woodpark, ballinteer dublin 16 nan
dublin 3 9a st barnabas gardens, east wall, dublin 3 nan
dublin 6w 45 priory rd, harolds cross, dublin 6w nan
dublin 1 34 courtyard, hill st, dublin 1 nan
dublin 7 no 7 kirwin street, stoneybatter, dublin 7 nan
dublin 6w 10 terenure gate, terenure road west, dublin 6w nan
dublin 1 apartment 23, 35 mountjoy sq, dublin 1 nan
dublin 1 52 hampton wood park, hampton wood, dublin 11 nan
dublin 11 52 hampton wood park, hampton wood, dublin 11 nan
dublin 1 589 woodview terrace, rathfarnham, dublin 14 nan
dublin 14 589 woodview terrace, rathfarnham, dublin 14 nan
dublin 7 313 ratoath road, cabra, dublin 7 nan
dublin 2 apt 17 hogan square, hogan place, dublin 2 nan
dublin 8 20 & 20a st james' terrace, dolphin's barn, dublin 8 nan
dublin 4 16 wellington road, ballsbridge, dublin 4 nan
dublin 1 23 boyd house, myrtle ave, the coast dublin 13 nan
dublin 13 23 boyd house, myrtle ave, the coast dublin 13 nan
dublin 1 5b la vista avenue, sutton, dublin 13 nan
dublin 13 5b la vista avenue, sutton, dublin 13 nan
dublin 1 9 sweetman house, baldoyle, dublin 13 nan
dublin 13 9 sweetman house, baldoyle, dublin 13 nan
dublin 1 4 barry road, finglas west, dublin 11 nan
dublin 11 4 barry road, finglas west, dublin 11 nan
dublin 3 50 st. lawrence road, clontarf, dublin 3 nan
dublin 6w 98 templeville rd, templeogue, dublin 6w nan
dublin 6 7 ashfield road, ranelagh, dublin 6 nan
dublin 1 16 hollystown rise, hollystown, dublin 15 nan
dublin 15 16 hollystown rise, hollystown, dublin 15 nan
dublin 8 11 o'carolan road, south circular road, dublin 8 nan
dublin 6w 21 terenure rd west, terenure, dublin 6w nan
dublin 1 14 dodder crescent, rathfarnham, dublin 14 nan
dublin 14 14 dodder crescent, rathfarnham, dublin 14 nan
dublin 1 8 washingston grove, rathfarnham, dublin 14 nan
dublin 14 8 washingston grove, rathfarnham, dublin 14 nan
dublin 2 11 lime street, dublin 2 nan
dublin 2 57 rathlyon grove, firhouse, dublin 24 nan
dublin 24 57 rathlyon grove, firhouse, dublin 24 nan
dublin 1 apt 35 stapleton house, 33 mountjoy square, dublin 1 nan
dublin 1 156 great britain now known as, 156 parnell street, dublin 1 nan
dublin 1 227 grange rd, rathfarnham, dublin 16 nan
dublin 16 227 grange rd, rathfarnham, dublin 16 nan
dublin 7 1 ormond place, dublin 7 nan
dublin 2 7 knockmore grove, tallaght, dublin 24 nan
dublin 24 7 knockmore grove, tallaght, dublin 24 nan
dublin 7 8 offaly road, cabra, dublin 7 nan
dublin 8 19 adelaide square, whitefriar street, dublin 8 nan
dublin 9 29 lorcan grove, santry, dublin 9 nan
dublin 1 69 gledswood park, clonskeagh, dublin 14 nan
dublin 14 69 gledswood park, clonskeagh, dublin 14 nan
dublin 6 166 harolds cross rd, harolds cross, dublin 6 nan
dublin 1 41 willow park road, glasnevin, dublin 11 nan
dublin 11 41 willow park road, glasnevin, dublin 11 nan
dublin 1 29 bersford house, dublin 1 nan
dublin 4 64 marlborough road, donnybrook, dublin 4 nan
dublin 2 9 temple woods, greenhills road, dublin 24 nan
dublin 24 9 temple woods, greenhills road, dublin 24 nan
dublin 2 37 hanover court, hanover quay, dublin 2 nan
dublin 1 24 temple manor grove, dublin 12, dublin nan
dublin 12 24 temple manor grove, dublin 12, dublin nan
dublin 1 37 lansdowne pk, knocklyon, dublin 16 nan
dublin 16 37 lansdowne pk, knocklyon, dublin 16 nan
dublin 2 21 exchange hall, tallaght, dublin 24 nan
dublin 24 21 exchange hall, tallaght, dublin 24 nan
dublin 1 8 the crescent, bellingsmore, dublin 15 nan
dublin 15 8 the crescent, bellingsmore, dublin 15 nan
dublin 6 36 larkfield park, harolds cross, dublin 6 nan
dublin 8 28 south square, inchicore, dublin 8 nan
dublin 1 2 hollywoodrath road, hollystown, dublin 15 nan
dublin 15 2 hollywoodrath road, hollystown, dublin 15 nan
dublin 1 37 annfield crescent, castleknock, dublin 15 nan
dublin 15 37 annfield crescent, castleknock, dublin 15 nan
dublin 8 13 tandy court, spitalfields, francis st dublin 8 nan
dublin 1 37 ashlawn, ballinteer road, dublin 16 nan
dublin 16 37 ashlawn, ballinteer road, dublin 16 nan
dublin 1 24  streamville road, donaghmede, dublin 13 nan
dublin 13 24  streamville road, donaghmede, dublin 13 nan
dublin 1 4 elton courts, ard na greine, dublin 13 nan
dublin 13 4 elton courts, ard na greine, dublin 13 nan
dublin 1 19 shielmartin rd, sutton, dublin 13 nan
dublin 13 19 shielmartin rd, sutton, dublin 13 nan
dublin 1 4 castleknock close, castleknock, dublin 15 nan
dublin 15 4 castleknock close, castleknock, dublin 15 nan
dublin 6 27 drummond place, harold's cross, dublin 6 nan
dublin 1 114 millbrook avenue, kilbarrack west, dublin 13 nan
dublin 13 114 millbrook avenue, kilbarrack west, dublin 13 nan
dublin 1 18 hollywoodrath crescent, hollystown, dublin 15 nan
dublin 15 18 hollywoodrath crescent, hollystown, dublin 15 nan
dublin 1 11 stillorgan gate, kilmacud road upper, dublin 14 nan
dublin 14 11 stillorgan gate, kilmacud road upper, dublin 14 nan
dublin 3 18 st aidans park ave, marino, dublin 3 nan
dublin 1 78 kildare road, crumlin, dublin 12 nan
dublin 12 78 kildare road, crumlin, dublin 12 nan
dublin 1 240 the cherries, wedgewood road, sandyford dublin 18 nan
dublin 18 240 the cherries, wedgewood road, sandyford dublin 18 nan
dublin 1 3 summerhill place, dublin 1 nan
dublin 6w 19 casimir avenue, harolds cross, dublin 6w nan

In [18]:
# Count of NAN values after using address postal codes
df["Postal_Code"].isna().sum()

7833

## Section 2: Not full market price

### Section 2.x: Invert not full market price

In [19]:
def invert_yes_no(not_full_market_price):
    """Function that inverts the values in not full market price to solve the double negative issue"""
    if not_full_market_price == "no":
        return "yes"

    else:
        return "no"

In [20]:
df["Not_Full_Market_Price"] = df["Not_Full_Market_Price"].apply(convert_to_small_caps)
df["Not_Full_Market_Price"] = df["Not_Full_Market_Price"].apply(invert_yes_no)
df.rename(columns={"Not_Full_Market_Price": "Full_Market_Price"}, inplace=True)

In [21]:
df.head()

,Date_of_Sale,Address,Postal_Code,County,Price_(€),Full_Market_Price,VAT_Exclusive,Description_of_Property,Property_Size_Description
0,2020-05-21,"ballyglass, strokestown rd, lanesboro",NaN,Roscommon,180000.0,yes,No,Second-Hand Dwelling house /Apartment,NaN
1,2011-09-08,"26 newpark, kilkenny",NaN,Kilkenny,73500.0,yes,No,Second-Hand Dwelling house /Apartment,NaN
2,2021-09-24,"23 the courtyard, clonsilla, dublin 15",dublin 15,Dublin,280000.0,yes,No,Second-Hand Dwelling house /Apartment,NaN
3,2021-08-18,"137 racecourse meadows, racecourse rd, dundalk",NaN,Louth,205000.0,yes,No,Second-Hand Dwelling house /Apartment,NaN
4,2013-08-02,"96 shantalla road, beaumont",dublin 9,Dublin,282500.0,yes,No,Second-Hand Dwelling house /Apartment,NaN

In [22]:
df["Full_Market_Price"].value_counts()

yes    9524
no      476
Name: Full_Market_Price, dtype: int64

### Section 2.x: Drop rows where full market price = No

In [23]:
# Drop all rows with no for full market price, because it gives an inaccurate representation of price
df.drop(df[df["Full_Market_Price"] == "no"].index, inplace=True)
df.reset_index(drop=True, inplace=True)

In [24]:
df.shape

(9524, 9)

In [25]:
# Drop the full market price feature, because now it's all constant values
df.drop("Full_Market_Price", axis=1, inplace=True)

In [26]:
df.head()

,Date_of_Sale,Address,Postal_Code,County,Price_(€),VAT_Exclusive,Description_of_Property,Property_Size_Description
0,2020-05-21,"ballyglass, strokestown rd, lanesboro",NaN,Roscommon,180000.0,No,Second-Hand Dwelling house /Apartment,NaN
1,2011-09-08,"26 newpark, kilkenny",NaN,Kilkenny,73500.0,No,Second-Hand Dwelling house /Apartment,NaN
2,2021-09-24,"23 the courtyard, clonsilla, dublin 15",dublin 15,Dublin,280000.0,No,Second-Hand Dwelling house /Apartment,NaN
3,2021-08-18,"137 racecourse meadows, racecourse rd, dundalk",NaN,Louth,205000.0,No,Second-Hand Dwelling house /Apartment,NaN
4,2013-08-02,"96 shantalla road, beaumont",dublin 9,Dublin,282500.0,No,Second-Hand Dwelling house /Apartment,NaN

## Section 3: Postal Code

### Section 3.x: Set the postal code to NAN when the county is outside Dublin

In [27]:
def postal_to_nan(postal_code, county):
    """Function that sets the postal code value to NAN whenever the property is outside of Dublin"""
    if county != "Dublin":
        return np.nan

    else:
        return postal_code

In [28]:
# Alter the postal code feature so that it no longer contains postal codes when the property is outside of Dublin
df["Postal_Code"] = df.apply(lambda x: postal_to_nan(x["Postal_Code"], x["County"]), axis=1)

# Use our logical integrity check from section 1 to identify Dublin postal codes in non-Dublin properties
non_dublin_postal_codes = df[(df["County"] != "Dublin")]
non_dublin_postal_codes = non_dublin_postal_codes[~non_dublin_postal_codes["Postal_Code"].isna()]
print(f"Number of properties outside of Dublin with Dublin postal codes: {len(non_dublin_postal_codes)}")

Number of properties outside of Dublin with Dublin postal codes: 0

### Section 3.x: Fill missing values in postal code column

In [29]:
df["Postal_Code"].fillna("unknown", inplace=True)

## Section 4: Price

### Section 4.x: Add VAT to VAT exclusive rows

In [30]:
def add_vat(vat_exclusive, price):
    """Adds VAT to VAT exclusive rows"""
    if vat_exclusive == "Yes":
        return round(price * 1.135)

    return round(price)

In [31]:
df[df["VAT_Exclusive"] == "Yes"].head()

,Date_of_Sale,Address,Postal_Code,County,Price_(€),VAT_Exclusive,Description_of_Property,Property_Size_Description
5,2014-09-19,"24 barretstown meadows, roseberry, newbridge",unknown,Kildare,290749.00,Yes,New Dwelling house /Apartment,greater than or equal to 38 sq metres and less...
8,2010-01-18,"ballypheason, galway road, roscommon",unknown,Roscommon,246696.03,Yes,New Dwelling house /Apartment,greater than 125 sq metres
11,2019-11-14,"1 laharran west, manor farm, lehenaghbeg",unknown,Cork,298750.00,Yes,New Dwelling house /Apartment,NaN
13,2016-12-20,"apartment 16 neptune block, honeypark, dun lao...",unknown,Dublin,308370.00,Yes,New Dwelling house /Apartment,greater than or equal to 38 sq metres and less...
15,2016-12-16,"28 drury mills, saggart",unknown,Dublin,312775.00,Yes,New Dwelling house /Apartment,greater than or equal to 125 sq metres

In [32]:
df["Price_(€)"] = df.apply(lambda x: add_vat(x["VAT_Exclusive"], x["Price_(€)"]), axis=1)

In [33]:
df[df["VAT_Exclusive"] == "Yes"].head()

,Date_of_Sale,Address,Postal_Code,County,Price_(€),VAT_Exclusive,Description_of_Property,Property_Size_Description
5,2014-09-19,"24 barretstown meadows, roseberry, newbridge",unknown,Kildare,330000,Yes,New Dwelling house /Apartment,greater than or equal to 38 sq metres and less...
8,2010-01-18,"ballypheason, galway road, roscommon",unknown,Roscommon,280000,Yes,New Dwelling house /Apartment,greater than 125 sq metres
11,2019-11-14,"1 laharran west, manor farm, lehenaghbeg",unknown,Cork,339081,Yes,New Dwelling house /Apartment,NaN
13,2016-12-20,"apartment 16 neptune block, honeypark, dun lao...",unknown,Dublin,350000,Yes,New Dwelling house /Apartment,greater than or equal to 38 sq metres and less...
15,2016-12-16,"28 drury mills, saggart",unknown,Dublin,355000,Yes,New Dwelling house /Apartment,greater than or equal to 125 sq metres

### Section 4.x: Clamp outliers

In [34]:
print(np.min(df["Price_(€)"]))
print(np.max(df["Price_(€)"]))

5400
15002000

In [35]:
# Code reference: lab 4
a = df["Price_(€)"]

upper = np.percentile(a, 99)

lower = np.percentile(a, 1)

In [36]:
#Clamp the values in a to lower and upper bounds
a_clampped = np.zeros(a.size)

for i in range(a.size):
    if a[i] < lower:
        a_clampped[i] = round(lower)
    elif a[i] > upper:
            a_clampped[i] = round(upper)
    else: 
        a_clampped[i] = round(a[i])    

df["Price_(€)"] = a_clampped

In [37]:
print(np.min(df["Price_(€)"]))
print(np.max(df["Price_(€)"]))

23858.0
1390400.0

In [38]:
df.shape

(9524, 8)

### Section 4.x: Rename Price to be reflective of VAT

In [39]:
df.rename(columns={"Price_(€)": "Price_€_VAT_incl"}, inplace=True)
df.head()

,Date_of_Sale,Address,Postal_Code,County,Price_€_VAT_incl,VAT_Exclusive,Description_of_Property,Property_Size_Description
0,2020-05-21,"ballyglass, strokestown rd, lanesboro",unknown,Roscommon,180000.0,No,Second-Hand Dwelling house /Apartment,NaN
1,2011-09-08,"26 newpark, kilkenny",unknown,Kilkenny,73500.0,No,Second-Hand Dwelling house /Apartment,NaN
2,2021-09-24,"23 the courtyard, clonsilla, dublin 15",dublin 15,Dublin,280000.0,No,Second-Hand Dwelling house /Apartment,NaN
3,2021-08-18,"137 racecourse meadows, racecourse rd, dundalk",unknown,Louth,205000.0,No,Second-Hand Dwelling house /Apartment,NaN
4,2013-08-02,"96 shantalla road, beaumont",dublin 9,Dublin,282500.0,No,Second-Hand Dwelling house /Apartment,NaN

In [40]:
df.drop("VAT_Exclusive", axis=1, inplace=True)

In [41]:
df.head()

,Date_of_Sale,Address,Postal_Code,County,Price_€_VAT_incl,Description_of_Property,Property_Size_Description
0,2020-05-21,"ballyglass, strokestown rd, lanesboro",unknown,Roscommon,180000.0,Second-Hand Dwelling house /Apartment,NaN
1,2011-09-08,"26 newpark, kilkenny",unknown,Kilkenny,73500.0,Second-Hand Dwelling house /Apartment,NaN
2,2021-09-24,"23 the courtyard, clonsilla, dublin 15",dublin 15,Dublin,280000.0,Second-Hand Dwelling house /Apartment,NaN
3,2021-08-18,"137 racecourse meadows, racecourse rd, dundalk",unknown,Louth,205000.0,Second-Hand Dwelling house /Apartment,NaN
4,2013-08-02,"96 shantalla road, beaumont",dublin 9,Dublin,282500.0,Second-Hand Dwelling house /Apartment,NaN

## Section 5: Property Size Description

### Section 5.x: Replace NAN values with unknown

In [42]:
# df["Property_Size_Description"].fillna("unknown", inplace=True)
# df["Property_Size_Description"].isna().sum()
df["Property_Size_Description"] = df["Property_Size_Description"].astype("object")
df["Property_Size_Description"].fillna("unknown", inplace=True)
df.dtypes

Date_of_Sale                 datetime64[ns]
Address                              object
Postal_Code                          object
County                             category
Price_€_VAT_incl                    float64
Description_of_Property            category
Property_Size_Description            object
dtype: object

In [43]:
df.head()

,Date_of_Sale,Address,Postal_Code,County,Price_€_VAT_incl,Description_of_Property,Property_Size_Description
0,2020-05-21,"ballyglass, strokestown rd, lanesboro",unknown,Roscommon,180000.0,Second-Hand Dwelling house /Apartment,unknown
1,2011-09-08,"26 newpark, kilkenny",unknown,Kilkenny,73500.0,Second-Hand Dwelling house /Apartment,unknown
2,2021-09-24,"23 the courtyard, clonsilla, dublin 15",dublin 15,Dublin,280000.0,Second-Hand Dwelling house /Apartment,unknown
3,2021-08-18,"137 racecourse meadows, racecourse rd, dundalk",unknown,Louth,205000.0,Second-Hand Dwelling house /Apartment,unknown
4,2013-08-02,"96 shantalla road, beaumont",dublin 9,Dublin,282500.0,Second-Hand Dwelling house /Apartment,unknown

### Section 5.x: Merge redundant categories

In [44]:
df["Postal_Code"] = df["Postal_Code"].astype("category")
df["Property_Size_Description"] = df["Property_Size_Description"].astype("category")

In [45]:
df["Property_Size_Description"].value_counts()

unknown                                                              8505
greater than or equal to 38 sq metres and less than 125 sq metres     745
greater than 125 sq metres                                            136
greater than or equal to 125 sq metres                                 78
less than 38 sq metres                                                 60
Name: Property_Size_Description, dtype: int64

In [46]:
def change_size_descriptions(description):
    """Reencodes the property size description feature and merges two levels
    
    The merged levels both represent properties that are > 125 sq metres in size
    """
    if pd.isnull(description):
        return description

    else:
        if description == "less than 38 sq metres":
            return "< 38"

        elif description == "greater than or equal to 38 sq metres and less than 125 sq metres":
            return "38 - 125"

        elif description == "unknown":
            return "unknown"

        else:
            return ">= 125"

In [47]:
df["Property_Size_Description"] = df.apply(lambda x: change_size_descriptions(x["Property_Size_Description"]), axis=1)
df["Property_Size_Description"].value_counts()

unknown     8505
38 - 125     745
>= 125       214
< 38          60
Name: Property_Size_Description, dtype: int64

In [48]:
df.head()

,Date_of_Sale,Address,Postal_Code,County,Price_€_VAT_incl,Description_of_Property,Property_Size_Description
0,2020-05-21,"ballyglass, strokestown rd, lanesboro",unknown,Roscommon,180000.0,Second-Hand Dwelling house /Apartment,unknown
1,2011-09-08,"26 newpark, kilkenny",unknown,Kilkenny,73500.0,Second-Hand Dwelling house /Apartment,unknown
2,2021-09-24,"23 the courtyard, clonsilla, dublin 15",dublin 15,Dublin,280000.0,Second-Hand Dwelling house /Apartment,unknown
3,2021-08-18,"137 racecourse meadows, racecourse rd, dundalk",unknown,Louth,205000.0,Second-Hand Dwelling house /Apartment,unknown
4,2013-08-02,"96 shantalla road, beaumont",dublin 9,Dublin,282500.0,Second-Hand Dwelling house /Apartment,unknown

## Section 6: Date of Sale

### Section 6.x: Create a month of sale feature

In [49]:
df["Month_of_Sale"] = df["Date_of_Sale"].dt.month_name().astype("category")

### Section 6.x: Create a quarter of sale feature

In [50]:
df["Quarter_of_Sale"] = df["Date_of_Sale"].dt.quarter.astype("category")

In [51]:
df.head()

,Date_of_Sale,Address,Postal_Code,County,Price_€_VAT_incl,Description_of_Property,Property_Size_Description,Month_of_Sale,Quarter_of_Sale
0,2020-05-21,"ballyglass, strokestown rd, lanesboro",unknown,Roscommon,180000.0,Second-Hand Dwelling house /Apartment,unknown,May,2
1,2011-09-08,"26 newpark, kilkenny",unknown,Kilkenny,73500.0,Second-Hand Dwelling house /Apartment,unknown,September,3
2,2021-09-24,"23 the courtyard, clonsilla, dublin 15",dublin 15,Dublin,280000.0,Second-Hand Dwelling house /Apartment,unknown,September,3
3,2021-08-18,"137 racecourse meadows, racecourse rd, dundalk",unknown,Louth,205000.0,Second-Hand Dwelling house /Apartment,unknown,August,3
4,2013-08-02,"96 shantalla road, beaumont",dublin 9,Dublin,282500.0,Second-Hand Dwelling house /Apartment,unknown,August,3

## Section 7: Drop unused feaures

In [52]:
df.drop(["Address"], axis=1, inplace=True)

In [53]:
df.head()

,Date_of_Sale,Postal_Code,County,Price_€_VAT_incl,Description_of_Property,Property_Size_Description,Month_of_Sale,Quarter_of_Sale
0,2020-05-21,unknown,Roscommon,180000.0,Second-Hand Dwelling house /Apartment,unknown,May,2
1,2011-09-08,unknown,Kilkenny,73500.0,Second-Hand Dwelling house /Apartment,unknown,September,3
2,2021-09-24,dublin 15,Dublin,280000.0,Second-Hand Dwelling house /Apartment,unknown,September,3
3,2021-08-18,unknown,Louth,205000.0,Second-Hand Dwelling house /Apartment,unknown,August,3
4,2013-08-02,dublin 9,Dublin,282500.0,Second-Hand Dwelling house /Apartment,unknown,August,3

In [54]:
df.isna().sum()

Date_of_Sale                 0
Postal_Code                  0
County                       0
Price_€_VAT_incl             0
Description_of_Property      0
Property_Size_Description    0
Month_of_Sale                0
Quarter_of_Sale              0
dtype: int64

### Section 8: Save final dataset

In [55]:
df.head()

,Date_of_Sale,Postal_Code,County,Price_€_VAT_incl,Description_of_Property,Property_Size_Description,Month_of_Sale,Quarter_of_Sale
0,2020-05-21,unknown,Roscommon,180000.0,Second-Hand Dwelling house /Apartment,unknown,May,2
1,2011-09-08,unknown,Kilkenny,73500.0,Second-Hand Dwelling house /Apartment,unknown,September,3
2,2021-09-24,dublin 15,Dublin,280000.0,Second-Hand Dwelling house /Apartment,unknown,September,3
3,2021-08-18,unknown,Louth,205000.0,Second-Hand Dwelling house /Apartment,unknown,August,3
4,2013-08-02,dublin 9,Dublin,282500.0,Second-Hand Dwelling house /Apartment,unknown,August,3

In [56]:
df.to_csv('cleaned_data.csv', index=False)